Revit 2027 API
DividedSurface.NumberOfUGridlines Property
Get the number of U-gridlines used on the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfUGridlines { get; }
Public ReadOnly Property NumberOfUGridlines As Integer
	Get
public:
property int NumberOfUGridlines {
	int get ();
}
member NumberOfUGridlines : int with get
Property Value
Int32
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace